#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.archive_file.docker_context: Reading...
data.archive_file.docker_context: Read complete after 0s [id=faa95f0ae5347474de6e7c17827f0e10f031a48e]
module.aws_lambda_function.data.aws_partition.current: Reading...
data.aws_ecr_authorization_token.token: Reading...
module.aws_lambda_function.data.aws_caller_identity.current: Reading...
module.docker_image.data.aws_region.current: Reading...
module.docker_image.data.aws_caller_identity.this: Reading...
module.docker_image.aws_ecr_repository.this[0]: Refreshing state... [id=climate-analysis]
module.aws_lambda_function.data.aws_region.current: Reading...
aws_apigatewayv2_api.api: Refreshing state... [id=040fg458ka]
aws_s3_bucket.app_s3: Refreshing state... [id=climate-analysis-bucket]
module.aws_lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/climate_analysis_lambda]
module.aws_lambda_function.data.aws_region.current: Read complete after 0s [id=eu-north-1]
module.docker_image.data.aws_region.current: Read complete after 0s [id=eu-north-1]
module.aws_lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
aws_iam_role.app_role: Refreshing state... [id=climate_app_role]
module.aws_lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=266796786618]
module.docker_image.data.aws_caller_identity.this: Read complete after 0s [id=266796786618]
aws_iam_role_policy_attachment.ecs_read: Refreshing state... [id=climate_app_role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=climate_app_role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
data.aws_caller_identity.current: Read complete after 0s [id=266796786618]
aws_apigatewayv2_stage.default_stage: Refreshing state... [id=$default]
data.aws_ecr_authorization_token.token: Read complete after 1s [id=eu-north-1]
module.docker_image.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=climate-analysis]
module.docker_image.docker_image.this: Refreshing state... [id=sha256:b52023c0f84a10cb024f80085df5f5e83c4f77afdb6ce7ef1bc5abe119c4a342266796786618.dkr.ecr.eu-north-1.amazonaws.com/climate-analysis:BSNUTlx9-cEi]
module.docker_image.docker_registry_image.this: Refreshing state... [id=sha256:12b9896c8cc89e32bdb6100d98e7c41dbe03bae75c175389108e4afa82c0b7b0]
null_resource.cleanup_zip: Refreshing state... [id=9034304018553160492]
module.aws_lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=climate_analysis_lambda]
aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=a4fgymd]
aws_lambda_permission.apigw_invoke: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_apigatewayv2_route.root_route: Refreshing state... [id=i3s6lws]
data.aws_iam_policy_document.aws_policy_doc: Reading...
data.aws_iam_policy_document.aws_policy_doc: Read complete after 0s [id=1638820244]
aws_s3_bucket_public_access_block.s3_access: Refreshing state... [id=climate-analysis-bucket]
aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::266796786618:policy/climate_analysis_resources_policy]
aws_iam_role_policy_attachment.app_role_policy_attach: Refreshing state... [id=climate_app_role/arn:aws:iam::266796786618:policy/climate_analysis_resources_policy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_image.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:b52023c0f84a10cb024f80085df5f5e83c4f77afdb6ce7ef1bc5abe119c4a342266796786618.dkr.ecr.eu-north-1.amazonaws.com/climate-analysis:BSNUTlx9-cEi"
      - image_id     = "sha256:b52023c0f84a10cb024f80085df5f5e83c4f77afdb6ce7ef1bc5abe119c4a342" -> null
      - name         = "266796786618.dkr.ecr.eu-north-1.amazonaws.com/climate-analysis:BSNUTlx9-cEi" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.docker_image.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "266796786618.dkr.ecr.eu-north-1.amazonaws.com/climate-analysis:BSNUTlx9-cEi"
      + repo_digest  = (known after apply)

      + build {
          + cache_from     = []
          + context        = "../"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (13 unchanged attributes hidden)
        }
    }

  # module.docker_image.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:12b9896c8cc89e32bdb6100d98e7c41dbe03bae75c175389108e4afa82c0b7b0" -> (known after apply)
        name                 = "266796786618.dkr.ecr.eu-north-1.amazonaws.com/climate-analysis:BSNUTlx9-cEi"
      ~ sha256_digest        = "sha256:12b9896c8cc89e32bdb6100d98e7c41dbe03bae75c175389108e4afa82c0b7b0" -> (known after apply)
      ~ triggers             = {
          - "image_id" = "sha256:b52023c0f84a10cb024f80085df5f5e83c4f77afdb6ce7ef1bc5abe119c4a342"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @ana-sher, Action: `pull_request`*